# pandasによるデータ処理2

In [4]:
import numpy as np
import pandas as pd

## 練習問題1

以下のデータフレームを考える。 これは5名の学生がそれぞれの教科(国語、数学、英語）の得点を示したものである。

<table>
    <tr>
        <th></th>
        <th>J</th>
        <th>M</th>
        <th>E</th>
    </tr>
    <tr>
        <th>AA</th>
        <td>44</td>
        <td>90</td>
        <td>54</td>
    </tr>
    <tr>
        <th>BB</th>
        <td>78</td>
        <td>76</td>
        <td>79</td>
    </tr>
    <tr>
        <th>CC</th>
        <td>92</td>
        <td>88</td>
        <td>93</td>
    </tr>
    <tr>
        <th>DD</th>
        <td>54</td>
        <td>55</td>
        <td>81</td>
    </tr>
    <tr>
        <th>EE</th>
        <td>89</td>
        <td>74</td>
        <td>95</td>
    </tr>
</table>

このデータフレームmarksを作り、各教科ごとの順位を示したデータフレームを求めよ。

In [ ]:
marks = pd.DataFrame({'J': [44, 78, 92, 54, 89], 'M': [90, 76, 88, 55, 74], 'E': [54, 79, 93, 81, 95]}, index=['AA', 'BB', 'CC', 'DD', 'EE'])
marks.rank(ascending=False)

      J    M    E
AA  5.0  1.0  5.0
BB  3.0  3.0  4.0
CC  1.0  2.0  2.0
DD  4.0  5.0  3.0
EE  2.0  4.0  1.0

## 練習問題2

練習問題1のデータフレームを用い、各教科で最高点を取った者の名前を示したシリーズを求めよ。

In [ ]:
marks.idxmax()

J    CC
M    AA
E    EE
dtype: object

In [13]:
import pandas_datareader.data as web
all_data = {ticker: web.get_data_yahoo(ticker) for ticker in ['AAPL', 'IBM', 'MSFT', 'GOOG']}

price = pd.DataFrame({ticker: data['Adj Close'] for ticker, data in all_data.items()})
volume = pd.DataFrame({ticker: data['Volume'] for ticker, data in all_data.items()})

In [14]:
returns = price.pct_change()
returns.tail()

                AAPL       IBM      MSFT      GOOG
Date
2021-06-24 -0.002169  0.005740  0.005353  0.006488
2021-06-25 -0.002249  0.009626 -0.006262 -0.002255
2021-06-28  0.012546 -0.010556  0.013961 -0.001382
2021-06-29  0.011500  0.001790  0.009973 -0.006316
2021-06-30  0.004621  0.007145 -0.001842 -0.005575

In [15]:
returns.corr()

          AAPL       IBM      MSFT      GOOG
AAPL  1.000000  0.442724  0.725843  0.658425
IBM   0.442724  1.000000  0.523463  0.489079
MSFT  0.725843  0.523463  1.000000  0.772842
GOOG  0.658425  0.489079  0.772842  1.000000

In [16]:
returns.cov()

          AAPL       IBM      MSFT      GOOG
AAPL  0.000363  0.000138  0.000238  0.000210
IBM   0.000138  0.000266  0.000147  0.000134
MSFT  0.000238  0.000147  0.000296  0.000223
GOOG  0.000210  0.000134  0.000223  0.000282

## 練習問題3

練習問題1のデータフレームで、国語と英語の得点の相関係数を求めよ。

In [ ]:
marks.corrwith(marks['E'])['J']

0.8712200243905397

In [ ]:
marks.corrwith(marks['J'])['E']

0.8712200243905397

## 練習問題4

以下のような階層型インデックスを持つデータフレームを作成せよ。

<table>
    <tr>
        <th></th>
        <th></th>
        <th>Product_ID</th>
        <th>Qty</th>
        <th>Amonut</th>
        <th>Tax</th>
    </tr>
    <tr>
        <th>Sales_No</th>
        <th>Sales_Item_No</th>
        <th></th>
        <th></th>
        <th></th>
        <th></th>
    </tr>
    <tr>
        <th>A001</th>
        <th>1</th>
        <td>P001</td>
        <td>1</td>
        <td>7000</td>
        <td>560</td>
    </tr>
    <tr>
        <th></th>
        <th>2</th>
        <td>P002</td>
        <td>2</td>
        <td>7700</td>
        <td>616</td>
    </tr>
    <tr>
        <th>A002</th>
        <th>1</th>
        <td>P003</td>
        <td>1</td>
        <td>6800</td>
        <td>544</td>
    </tr>
    <tr>
        <th></th>
        <th>2</th>
        <td>P006</td>
        <td>4</td>
        <td>35000</td>
        <td>2800</td>
    </tr>
</table>

In [18]:
frame = pd.DataFrame({'Product_ID': ['P001', 'P002', 'P003', 'P006'], 'Qty': [1, 2, 1, 4], \
                      'Amount': [7000, 7700, 6800, 35000], 'Tax': [560, 616, 544, 2800]}, \
                     index=[['A001', 'A001', 'A002', 'A002'], [1, 2, 1, 2]])
frame.index.names = ['Sales_No', 'Sales_Item_No']
frame

                       Product_ID  Qty  Amount   Tax
Sales_No Sales_Item_No
A001     1                   P001    1    7000   560
         2                   P002    2    7700   616
A002     1                   P003    1    6800   544
         2                   P006    4   35000  2800

## 練習問題5

練習問題4で作ったデータフレームに対し、Sales_No=A002のAmountの合計を求めよ。

ヒント. 和を表すデータフレームを作り、Sales_No=A002のAmountの要素を取り出す。

In [20]:
frame.sum(level='Sales_No').loc['A002', 'Amount']

41800

## 練習問題6

以下のようなデータフレームemploymentを作り、

<table>
    <tr>
        <th>year</th>
        <th>H27</th>
        <th></th>
        <th></th>
        <th>H22</th>
        <th></th>
        <th></th>
    </tr>
    <tr>
        <th>sector</th>
        <th>pr</th>
        <th>sec</th>
        <th>ter</th>
        <th>pr</th>
        <th>sec</th>
        <th>ter</th>
    </tr>
    <tr>
        <th>city</th>
        <th></th>
        <th></th>
        <th></th>
        <th></th>
        <th></th>
        <th></th>
    </tr>
    <tr>
        <th>Nagasaki</th>
        <td>3658</td>
        <td>36181</td>
        <td>146548</td>
        <td>4060</td>
        <td>35833</td>
        <td>149230</td>
    </tr>
    <tr>
        <th>Sasebo</th>
        <td>4828</td>
        <td>21498</td>
        <td>86854</td>
        <td>5180</td>
        <td>22374</td>
        <td>86683</td>
    </tr>
    <tr>
        <th>Shimabara</th>
        <td>3214</td>
        <td>4203</td>
        <td>13869</td>
        <td>3310</td>
        <td>4321</td>
        <td>13775</td>
    </tr>
</table>

これを以下のようなデータフレームに変換せよ。

<table>
    <tr>
        <th>sector</th>
        <th></th>
        <th>pr</th>
        <th>sec</th>
        <th>ter</th>
    </tr>
    <tr>
        <th>city</th>
        <th>year</th>
        <th></th>
        <th></th>
        <th></th>
        <th></th>
    </tr>
    <tr>
        <th>Nagasaki</th>
        <th>H22</th>
        <td>4060</td>
        <td>35833</td>
        <td>149230</td>
    </tr>
    <tr>
        <th>Nagasaki</th>
        <th>H27</th>
        <td>3658</td>
        <td>36181</td>
        <td>146548</td>
    </tr>
    <tr>
        <th>Sasebo</th>
        <th>H22</th>
        <td>5180</td>
        <td>22374</td>
        <td>86683</td>
    </tr>
    <tr>
        <th>Sasebo</th>
        <th>H27</th>
        <td>4828</td>
        <td>21498</td>
        <td>86854</td>
    </tr>
    <tr>
        <th>Shimabara</th>
        <th>H22</th>
        <td>3310</td>
        <td>4321</td>
        <td>13775</td>
    </tr>
    <tr>
        <th>Shimabara</th>
        <th>H27</th>
        <td>3214</td>
        <td>4203</td>
        <td>13869</td>
    </tr>
</table>

In [12]:
employment = pd.DataFrame(np.array([3658, 36181, 146548, 4060, 35833, 149230, \
                                    4828, 21498, 86854, 5180, 22374, 86683, \
                                    3214, 4203, 13869, 3310, 4321, 13775]).reshape(3, 6), \
                          index=pd.Index(['Nagasaki', 'Sasebo', 'Shimabara'], name='city'), \
                          columns=pd.MultiIndex.from_arrays([['H27', 'H27', 'H27', 'H22', 'H22', 'H22'], \
                                                             ['pr', 'sec', 'ter', 'pr', 'sec', 'ter']], \
                                                            names=['year', 'sector']))
#employment
employment.stack(level='year')

sector            pr    sec     ter
city      year
Nagasaki  H22   4060  35833  149230
          H27   3658  36181  146548
Sasebo    H22   5180  22374   86683
          H27   4828  21498   86854
Shimabara H22   3310   4321   13775
          H27   3214   4203   13869

## 練習問題7

以下のデータフレームuriageを作成し、商品ごとに売り上げた価格の合計を表すシリーズを求めよ。Priceは商品一つ当たりの価格、Quantityは売り上げた個数である。ただしfor文は使用しないこと。

<table>
    <tr>
        <th></th>
        <th>Goods</th>
        <th>Price</th>
        <th>Quantity</th>
    </tr>
    <tr>
        <th>Yamada</th>
        <td>Printer</td>
        <td>30000</td>
        <td>5</td>
    </tr>
    <tr>
        <th>Suzuki</th>
        <td>DigCam</td>
        <td>25000</td>
        <td>8</td>
    </tr>
    <tr>
        <th>Suzuki</th>
        <td>Scanner</td>
        <td>25000</td>
        <td>8</td>
    </tr>
    <tr>
        <th>Kato</th>
        <td>PC</td>
        <td>11000</td>
        <td>6</td>
    </tr>
    <tr>
        <th>Yamada</th>
        <td>Printer</td>
        <td>30000</td>
        <td>3</td>
    </tr>
    <tr>
        <th>Yamada</th>
        <td>PC</td>
        <td>110000</td>
        <td>3</td>
    </tr>
</table>

In [ ]:
uriage = pd.DataFrame({'Goods': ['Printer', 'DigCam', 'Scanner', 'PC', 'Printer', 'PC'], \
                       'Price': [30000, 25000, 20000, 110000, 30000, 110000], \
                       'Quantity': [5, 8, 3, 6, 3, 3]},
                      index=['Yamada', 'Suzuki', 'Suziki', 'Kato', 'Yamada', 'Yamada'])
uriage['Price'].groupby(uriage['Goods']).mean() * uriage['Quantity'].groupby(uriage['Goods']).sum()

Goods
DigCam     200000
PC         990000
Printer    240000
Scanner     60000
dtype: int64

## 練習問題8

練習問題6で作ったデータフレームemploymentに対し、各年度の就業者合計数を表した以下のようなデータフレームを作成せよ。

<table>
    <tr>
        <th>year</th>
        <th>H22</th>
        <th>H27</th>
    </tr>
    <tr>
        <th>city</th>
        <th></th>
        <th></th>
    </tr>
    <tr>
        <th>Nagasaki</th>
        <td>189123</td>
        <td>186387</td>
    </tr>
    <tr>
        <th>Sasebo</th>
        <td>114237</td>
        <td>113180</td>
    </tr>
    <tr>
        <th>Shimabara</th>
        <td>21406</td>
        <td>21286</td>
    </tr>
</table>

In [ ]:
employment.groupby(level='year', axis=1).sum()

year          H22     H27
city
Nagasaki   189123  186387
Sasebo     114237  113180
Shimabara   21406   21286

## 練習問題9

練習問題7で作ったデータフレームuriageに対し、商品ごとにPriceとQuantityを示したデータフレームを求めよ。

In [ ]:
uriage.groupby('Goods').agg({'Price': 'mean', 'Quantity': 'sum'})

          Price  Quantity
Goods
DigCam    25000         8
PC       110000         9
Printer   30000         8
Scanner   20000         3